Reports/ОтчетОплатаПоРайонах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ОтчетОплатаПоРайонах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ОтчетОплатаПоРайонах/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьЗапросНаСервере(ТабДок)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Макет = Отчеты.ОтчетОплатаПоРайонах.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДенежныеСредства.Организация КАК Организация,
		|	ПРЕДСТАВЛЕНИЕ(ДенежныеСредства.Организация),
		|	ДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|	ПРЕДСТАВЛЕНИЕ(ДенежныеСредства.БанковскийСчетКасса),
		|	ДенежныеСредства.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
		|ГДЕ
		|	ДенежныеСредства.Регистратор.Здание.Наименование ПОДОБНО ""%"" + &Наименование + ""%""
		|	И ДенежныеСредства.Период МЕЖДУ &НачПериода И &КонПериода
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	ОБЩИЕ,
		|	Организация,
		|	БанковскийСчетКасса";
	
	Запрос.УстановитьПараметр("Наименование", Отчет.НаселенныйПункт);
	Запрос.УстановитьПараметр("НачПериода", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Отчет.Период.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьОрганизация = Макет.ПолучитьОбласть("Организация");
	ОбластьБанковскийСчетКасса = Макет.ПолучитьОбласть("БанковскийСчетКасса");
	
	ТабДок.Очистить();
	ОбластьЗаголовок.Параметры.НасПункт = Отчет.НаселенныйПункт;
	ОбластьЗаголовок.Параметры.ДатаНачала = Отчет.Период.ДатаНачала;
	ОбластьЗаголовок.Параметры.ДатаОкончания = Отчет.Период.ДатаОкончания;
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Загальний підсумок
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());
	
	ВыборкаОрганизация = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		ОбластьОрганизация.Параметры.Заполнить(ВыборкаОрганизация);
		ТабДок.Вывести(ОбластьОрганизация, ВыборкаОрганизация.Уровень());
	
		ВыборкаБанковскийСчетКасса = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаБанковскийСчетКасса.Следующий() Цикл
			ОбластьБанковскийСчетКасса.Параметры.Заполнить(ВыборкаБанковскийСчетКасса);
			ТабДок.Вывести(ОбластьБанковскийСчетКасса, ВыборкаБанковскийСчетКасса.Уровень());
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗапрос(Команда)
	ТабДок = Результат;
	СформироватьЗапросНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры
